app/Http/Controllers/Site/AdvsController.php

    public function __construct()
    {
        $this->config = Advs_config::first();
---
select * from `ads_config` limit 1

    public function cat($dept_id, $dept_name)
    {

        //d(request()->all());
        $data['title'] = request('keyword') && request('keyword') != '' ? request('keyword') : $dept_name;
        $dept = $data['current_dept'] = Depts::findOrFail($dept_id);
        $data['child_dept'] = $dept;

        $data['current_dept'] = $dept->parent ?? $dept;
        if (request('first')) {
            $data['areas'] = Area::where('country_id', '!=', null)->get();
            $data['depts'] = Depts::where('parent_id', null)->get();
            $data['advs'] = $dept->all_advs->where('is_deleted', 0)->where('active', 1)->paginate(24);
            return view('site.pages.search', $data);
        }

        $order_type = request('order_type');
        $data['advs'] = Advs::where('active', 1);
        if ($distance = request('distance')) {
            $lat = $this->getUserIP()[0];
            $lng = $this->getUserIP()[1];
            $data['advs'] = $data['advs']->GetByDistance($lat, $lng, $distance);
        }

        $data['advs'] = $data['advs']->where('dept', $dept->id)->orderBy('created_at', 'DESC');

        $data['advs_count'] = $data['advs']->count();
        $data['advs'] = $data['advs']->paginate($this->config->per_page);
        $data['areas'] = Area::where('country_id', '!=', null)->get();
        $data['depts'] = Depts::where('parent_id', null)->get();
---
select * from `depts` where `depts`.`id` = '41' limit 1
select * from `area` where `country_id` is not null
select * from `depts` where `parent_id` is null

    public function show($id, $title)
    {
        $info = Advs::where(['slug' => $title, 'id' => $id, 'active' => 1])->first();
---
select * from `advs` where (`slug` = 'eeeee' and `id` = '445' and `active` = 1) limit 1


        $data['info'] = $info;
        $data['title'] = $info->title;
        $data['others'] = Advs::where('dept', $info->dept)->where('id', '!=', $id)->where('active', 1)->take(3)->get();
        Advs::where(['id' => $id])->update(['views' => $info->views + 1]);
---
select * from `advs` where `dept` = 1253 and `id` != '445' and `active` = 1 limit 3
update `advs` set `views` = 90, `advs`.`updated_at` = '2024-02-20 02:02:26' where (`id` = '445')