app/Http/Controllers/Site/IndexController.php

select * from `area` where `country_id` is not null
select * from `depts` where `parent_id` is null
select * from `advs` where (`active` = 1 and `is_deleted` = 0) order by `id` desc limit 20 offset 0
select count(*) as aggregate from `advs` where (`active` = 1 and `is_deleted` = 0)
select count(*) as aggregate from `advs` where (`active` = 1)
---
    public function home(Request $request)
    {
        // dd(url()->previous());
        if (isset ($request->session()->all()['commision_store'] )){
            // dd("kjkj");

        $adv = Advs::findOrFail($request->session()->all()['commision_store']['adv_id']);

        $adv->update([
            'active' => 1 ,
            'subscription_id' => $request->session()->all()['commision_store']['subscription_id'] ,
            'end_date' => Carbon::parse($adv->created_at)->addHour(Subscription::find($request->session()->all()['commision_store']['subscription_id'])->duration) ,
            ]);

            // dd("this ok");
            $data['areas']  = Area::where('country_id', '!=', null)->get();
        $data['depts'] = Depts::where('parent_id', null)->get();
        $data['advs'] = Advs::where(['active' => 1,'is_deleted'=>0])
            ->orderBy('id', 'desc')
            ->paginate(request('perpage' , 20));
        $data['advs_count'] = Advs::where(['active' => 1])->count();
        return view('site.pages.home', $data)->with('success', 'تم نشر الاعلان بنجاح');
        }
        $data['areas']  = Area::where('country_id', '!=', null)->get();
        $data['depts'] = Depts::where('parent_id', null)->get();
        $data['advs'] = Advs::where(['active' => 1,'is_deleted'=>0])
            ->orderBy('id', 'desc')
            ->paginate(request('perpage' , 20));
        $data['advs_count'] = Advs::where(['active' => 1])->count();