app/Http/Helper/myhelper.php

select * from `site_config` limit 1
---
function getSiteConfig($key = 'key')
{
    static $siteConfigList = null;
    if (null === $siteConfigList) {
        $siteConfigList = \App\Models\SiteConfig::first();

select * from `depts` where `parent_id` is null
select * from `site_config` limit 1
select * from `site_contacts`
select * from `pages`
select * from `area`
---
function layout_data()
{
    // $data['sliders']=\App\Sliders::all();
    static $depts = null;
    static $config = null;
    static $contacts = null;
    static $pages = null;
    static $area = null;
    if (is_null($depts)) {
        $depts = \App\Models\Depts::where('parent_id', null)->get();
    }
    if (null == $config) {
        $config = \App\Models\SiteConfig::first();
    }
    if (null == $contacts) {
        $contacts = \App\Models\SiteContacts::all();
    }
    if (null == $pages) {
        $pages = \App\Models\Pages::all();
    }
    if (null == $area) {
        $area = \App\Models\Area::all();

select * from `site_contacts` where `type` in ('twitter', 'facebook', 'google', 'youtube', 'instagram', 'snapchat-ghost', 'whats')
---
function site_socials()
{
    //'linkedin',
    $socials = DB::table('site_contacts')
        ->whereIn('type', ['twitter', 'facebook', 'google', 'youtube', 'instagram', 'snapchat-ghost', 'whats'])
        ->get();

select count(*) as aggregate from `rates` where `user_rated` = 136
select sum(`rate`) as aggregate from `rates` where `user_rated` = 136
---
function GetUserRate($user) {
    $rates = \App\Models\Rates::where('user_rated',$user->id)->count();
    $rate  = \App\Models\Rates::where('user_rated',$user->id)->sum('rate');